{
  "name": "rvm",
  "description": "Manages system-wide and per-user RVMs and manages installed Rubies. Several lightweight resources and providers (LWRP) are also defined.Installs and manages RVM. Includes several LWRPs.",
  "long_description": "Please refer to README.md (it's long).",
  "maintainer": "Aaron Kalin",
  "maintainer_email": "akalin@martinisoftware.com",
  "license": "Apache 2.0",
  "platforms": {
    "debian": ">= 0.0.0",
    "ubuntu": ">= 0.0.0",
    "suse": ">= 0.0.0",
    "centos": ">= 0.0.0",
    "amazon": ">= 0.0.0",
    "redhat": ">= 0.0.0",
    "fedora": ">= 0.0.0",
    "gentoo": ">= 0.0.0",
    "mac_os_x": ">= 0.0.0",
    "mac_os_x_server": ">= 0.0.0"
  },
  "dependencies": {
    "chef_gem": ">= 0.0.0"
  },
  "recommendations": {
    "java": ">= 0.0.0"
  },
  "suggestions": {
    "homebrew": ">= 0.0.0"
  },
  "conflicting": {

  },
  "providing": {

  },
  "replacing": {

  },
  "attributes": {

  },
  "groupings": {

  },
  "recipes": {
    "rvm": "Installs the RVM gem and initializes Chef to use the Lightweight Resources and Providers (LWRPs). Use this recipe explicitly if you only want access to the LWRPs provided.",
    "rvm::system_install": "Installs the RVM codebase system-wide (that is, into /usr/local/rvm). This recipe includes *default*. Use this recipe by itself if you want RVM installed system-wide but want to handle installing Rubies, invoking LWRPs, etc..",
    "rvm::system": "Installs the RVM codebase system-wide (that is, into /usr/local/rvm) and installs Rubies, global gems, and specific gems driven off attribute metadata. This recipe includes *default* and *system_install*. Use this recipe by itself if you want RVM system-wide with Rubies installed, etc.",
    "rvm::user_install": "Installs the RVM codebase for a list of users (selected from the node['rvm']['user_installs'] hash). This recipe includes *default*. Use this recipe by itself if you want RVM installed for specific users in isolation but want each user to handle installing Rubies, invoking LWRPs, etc.",
    "rvm::user": "Installs the RVM codebase for a list of users (selected from the node['rvm']['user_installs'] hash) and installs Rubies, global gems, and specific gems driven off attribute metadata. This recipe includes *default* and *user_install*. Use this recipe by itself if you want RVM installed for specific users in isolation with Rubies installed, etc.",
    "rvm::vagrant": "An optional recipe to help if running in a Vagrant virtual machine",
    "rvm::gem_package": "An experimental recipe that patches the gem_package resource"
  },
  "version": "0.9.4",
  "source_url": "",
  "issues_url": ""
}
